// File: "const.go"

package xlog

const (
	// Права доступа к файлу журнала по умолчанию
	// (при пустой строке конфигурации)
	FileModeDefault = 0640

	// Права доступа к файлу журнала в случае ошибки в строке конфигурации
	FileModeOnError = 0600 // разрешить чтение/запись только владельцу

	// Максимальный размер файла журнала в мегабайтах до его ротации по
	// умолчанию, если MaxSize=0
	RotateMaxSize = 10 // 10 мегабайт

	// Использовать JSON теги структур для форматированного их вывода
	// в журнал (только для TintHandler и для функции Sprint())
	UseJSONTags = true
)

const (
	// Добавить метки для дополнительных уровней логирования
	// (FLOOD/TRACE/NOTICE/CRIT/ALERT/EMERG/FATAL/PANIC)
	addLevels = true

	// Исправить один старый баг в log/slog для go1.20
	oldSlogFix = false // runtime.Version() < go1.21.0

	// Добавить небольшой фикс для выравнивания метки времени
	// до фиксированного числа символов (добавить при необходимости нули
	// в конец метки времени) для TintHandler'а.
	tintAlignTime = true

	// Добавить вывод комплексных чисел в JSON журнал как строк
	fixComplex = true
)

// EOF: "const.go"
